trade_exp/src/InformationRegisters/ОграниченияПоКолонкеОпт/ОграниченияПоКолонкеОпт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e1e1511d-d6f6-41c3-87f3-f3351094f58e">
  <name>ОграниченияПоКолонкеОпт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="a102de1d-667d-4167-be2f-e8bdfab8323c">
    <name>ТСК</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="87fba26b-ccf9-47fb-81a5-0317ea26b97f">
    <name>МД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5d267f67-35a9-4a07-9c4d-9cfabcefffd4">
    <name>МДР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="6712634d-258d-44c7-a1b6-b7163d728d73">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="813cc93b-4a4b-4135-b2ed-f77cc748e8ef">
    <name>ДатаВнесения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6c02350b-11fa-49a8-ac1c-074fcde34aec">
    <name>Инициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="e4292618-f06d-4b49-92d9-0dbfc6e7d4e5">
    <name>Регион</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b89cd840-e3b8-4ce3-804c-99e3b16dfe0a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ОграниченияПоКолонкеОпт/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТСКПриИзменении(Элемент)
	ОграничитьЗначения("ТСК");
КонецПроцедуры


&НаКлиенте
Процедура МДПриИзменении(Элемент)
	ОграничитьЗначения("МД");
КонецПроцедуры

&НаКлиенте
Процедура МДРПриИзменении(Элемент)
	ОграничитьЗначения("МДР");
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ОграничитьЗначения(ИмяРеквизита)
	если имяРеквизита="ТСК" тогда
		если Запись.ТСК=4 тогда
			Запись.МД=4; 
			Запись.МДР=4; 
		иначе
			Запись.МД=5;
			Запись.МДР=5; 
		конецесли;	
	 конецесли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	если Запись.ИсходныйКлючЗаписи.Пустой() тогда  
		Запись.ТСК=4;
		Запись.МД=4;
		Запись.МДР=4;
	конецесли;	
	
КонецПроцедуры
#КонецОбласти
